# Case When Lab

### Introduction

In this lesson, we'll use case when to work with data of different purchases.

### Loading our Data

For this lab, we'll use data from one of DBT's sample database.

In [1]:
import sqlite3
conn = sqlite3.connect('furniture_shop.db')

In [2]:
import pandas as pd
root_url = "https://raw.githubusercontent.com/data-eng-10-21/case-when/main/data/"
orders_df = pd.read_csv(f'{root_url}/updated_orders.csv', parse_dates=['order_date'])
payments_df = pd.read_csv(f'{root_url}/payments.csv')
customers_df = pd.read_csv(f'{root_url}/customers.csv')

In [3]:
orders_df.to_sql('orders', conn, index = False, if_exists = 'replace')
payments_df.to_sql('payments', conn, index = False, if_exists = 'replace')
customers_df.to_sql('customers', conn, index = False, if_exists = 'replace')

100

### Exploring our data

Now let's begin by working with our order data.

In [4]:
query = """
SELECT * FROM orders LIMIT 3;
"""
pd.read_sql(query, conn)

   id  user_id           order_date     status
0   1        1  2018-01-01 00:00:00   returned
1   2        3  2018-01-02 00:00:00  completed
2   3       94  2018-01-04 00:00:00  completed

We can see that each order has a different status.  Let's begin by viewing all of the different options under status.  Name of the column `status_types`.

In [6]:
query = """
select distinct(status) as status_types FROM orders
"""

pd.read_sql(query, conn)

# 	status_types
# 0	returned
# 1	completed
# 2	return_pending
# 3	shipped
# 4	placed

     status_types
0        returned
1       completed
2  return_pending
3         shipped
4          placed

And now let's count up the number of times each status occurs in our dataset, order from most to least.

In [10]:
query = """
select status, count(*) as amount 
from orders group by status 
order by amount desc
"""
pd.read_sql(query, conn)

# 	status	amount
# 0	completed	50
# 1	returned	33
# 2	shipped	7
# 3	placed	7
# 4	return_pending	2

           status  amount
0       completed      50
1        returned      33
2         shipped       7
3          placed       7
4  return_pending       2

Now let's try to get information on orders of each customer.  For each customer, count up the number of times he occurs in the orders database, as well as the number of orders that were completed and number of orders that were returned.  Order the data by the number of orders, and display the top five customers.

In [13]:
query = """
select * from orders limit 5;
"""
pd.read_sql(query, conn)

   id  user_id           order_date     status
0   1        1  2018-01-01 00:00:00   returned
1   2        3  2018-01-02 00:00:00  completed
2   3       94  2018-01-04 00:00:00  completed
3   4       50  2018-01-05 00:00:00  completed
4   5       64  2018-01-05 00:00:00   returned

In [19]:
query = """
select user_id,
count(*) as total_orders,
sum(case when status = 'returned' then 1 else 0 end) as returned,
sum(case when status = 'completed' then 1 else 0 end) as completed
from orders group by user_id order by total_orders desc limit 5;
"""
pd.read_sql(query, conn)

# user_id	total_orders	returned	completed
# 0	54	5	0	3
# 1	71	3	1	2
# 2	66	3	1	1
# 3	51	3	2	1
# 4	22	3	0	2

   user_id  total_orders  returned  completed
0       54             5         0          3
1       71             3         1          2
2       66             3         1          1
3       51             3         2          1
4       22             3         0          2

### Working with Payments

Next, let's work with our payments data.

In [60]:
query = """
SELECT * FROM payments
LIMIT 1
"""
pd.read_sql(query, conn)

   id  order_id payment_method  amount
0   1         1    credit_card    1000

Let's begin by viewing the amount of times each payment method was used, and order from most to least.

In [24]:
query = """
select payment_method, count(*) as amount
from payments group by payment_method 
order by amount desc
"""
pd.read_sql(query, conn)

# 	payment_method	amount
# 0	credit_card	55
# 1	bank_transfer	33
# 2	coupon	13
# 3	gift_card	12

  payment_method  amount
0    credit_card      55
1  bank_transfer      33
2         coupon      13
3      gift_card      12

Now for each customer, calculate the amount spent via credit card, bank transfer, other (if not spent by credit card or bank transfer), and the total amount spent.  Order by the total amount spent.  Limit to the first five customers.

In [39]:
query = """
select 
sum(amount) as total_spend,
sum(case when payment_method = 'credit_card' then amount else 0 end) as credit_spend,
sum(case when payment_method = 'bank_transfer' then amount else 0 end) as bank_spend,
sum(case when payment_method = 'bank_transfer' or payment_method = 'credit_card'  then 0 else amount end) as other
from payments 
join orders on payments.order_id = orders.id
group by user_id order by total_spend desc
limit 5;
"""
pd.read_sql(query, conn)

# 	user_id	total_spend	credit_spend	bank_spend	other_spend
# 0	51	9900	 6300	2000	1600
# 1	3	6500	3900	0	2600
# 2	46	6400	3400	0	3000
# 3	54	5700	2500	2600	600
# 4	30	5700	2900	0	2800

   total_spend  credit_spend  bank_spend  other
0         9900          6300        2000   1600
1         6500          3900           0   2600
2         6400          3400           0   3000
3         5700          2500        2600    600
4         5700          2900           0   2800

Now the above query includes returned orders, so let's perform the same query but this time update the query to exclude returned items.

In [41]:
query = """
select user_id,
sum(amount) as total_spend,
sum(case when payment_method = 'credit_card' then amount else 0 end) as credit_spend,
sum(case when payment_method = 'bank_transfer' then amount else 0 end) as bank_spend,
sum(case when payment_method = 'bank_transfer' or payment_method = 'credit_card'  then 0 else amount end) as other
from payments 
join orders on payments.order_id = orders.id
where status != 'returned'
group by user_id order by total_spend desc
limit 5;
"""
pd.read_sql(query, conn)


# user_id	total_spend	credit_spend	bank_spend	other_spend
# 0	51	5800	2200	2000	1600
# 1	54	5700	2500	2600	600
# 2	22	5200	0	500	4700
# 3	50	4700	2200	0	2500
# 4	71	4200	4200	0	0

   user_id  total_spend  credit_spend  bank_spend  other
0       51         5800          2200        2000   1600
1       54         5700          2500        2600    600
2       22         5200             0         500   4700
3       50         4700          2200           0   2500
4       71         4200          4200           0      0

### Summary

In this lesson, we saw how we can use case when statement to perform calculations on various customer orders.

### Resources

[Original data](https://github.com/dbt-labs/jaffle_shop)